SunbrightMedia/jn60c99/esp32s3/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
# 8 MB PSRAM (octal) -- the delay rings need 6.1 MB and this is the
# allocation the whole memory plan hinges on. If the actual module is quad,
# change SPIRAM_MODE_OCT to QUAD; the malloc path is the same.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384
# 240 MHz, the budget's denominator
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
# the FPU stays on in the main task; no lazy context tricks
CONFIG_FREERTOS_FPU_IN_ISR=n
CONFIG_COMPILER_OPTIMIZATION_PERF=y
# big FX states (chorus/delay/reverb, ~470 KB) live in PSRAM .bss -- the
# product keeps its rings there, so the cycle number should too
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y
# custom table: the listen app embeds a 1.69 MB coefficient blob
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y

# Biggest instruction cache and longest line: the engine's per-sample code
# footprint is what the board measured as the dominant cost.
CONFIG_ESP32S3_INSTRUCTION_CACHE_32KB=y
CONFIG_ESP32S3_INSTRUCTION_CACHE_LINE_64B=y
CONFIG_ESP32S3_ICACHE_ASSOCIATED_WAYS_8=y
CONFIG_ESP32S3_DATA_CACHE_64KB=y
CONFIG_ESP32S3_DATA_CACHE_LINE_64B=y
